Revit 2026 API

# FamilyInstanceIsWorkPlaneFlipped Property

---

Identifies if the instance's work plane is flipped.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsWorkPlaneFlipped { get; set; }
```
```vb
Public Property IsWorkPlaneFlipped As Boolean
	Get
	Set
```
```cpp
public:
property bool IsWorkPlaneFlipped {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsWorkPlaneFlipped : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InapplicableDataException | Work plane cannot be flipped for this instance. |

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace